lib_app/app/controllers/libraries_controller.rb

  def index
    @libraries = Library.all
---
SELECT "libraries".* FROM "libraries"

  def show
    @library = Library.find(params[:id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @library = Library.create(library_params)
---
INSERT INTO "libraries" ("name", "floor_count", "floor_area", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test Library"], ["floor_count", 11], ["floor_area", 12], ["created_at", 2016-08-16 22:02:47 UTC], ["updated_at", 2016-08-16 22:02:47 UTC]]